rule cicd_test {

  meta:
    author = "Davi Cruz"
    description = "Test Rule for CI/CD pipeline"
    type = "alert"
    severity = "Low"
    priority = "Low"

  events:
    $e.metadata.log_type = "AWS_CLOUDTRAIL"
    $e.metadata.event_type = "USER_LOGIN"
    $e.principal.user.userid" = "dcruz"

  condition:
    $e
}
