// original_name: cloud_honeypot_secret_access
rule cloud_honeypot_secret_access_archived_37840bc {

  meta:
    display_name = "Access to Honeypot Secret"
    tactic = "TA0009"
    author = "Guilherme Caproni de Faria"
    description = "Detects any access to the honeypot secret named 'vernissage-api-key-secret' across GCP using detection_fields for high fidelity."
    severity = "High"
    priority = "High"
    platform = "Google Cloud Platform"
    type = "Alert"
    data_source = "GCP Cloud Audit Logs"
    technique = "T1552.004"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1552/004/"

  events:
    $event.metadata.log_type = "GCP_CLOUDAUDIT"
    $event.target.application = "secretmanager.googleapis.com"
    $event.metadata.product_event_type = "google.cloud.secretmanager.v1.SecretManagerService.AccessSecretVersion"
    $event.security_result.detection_fields.value = /secrets\/.*vernissage-api-key-secret.*\/versions\/[^\/]+$/

  outcome:
    $rule_name = "Access to Honeypot Secret"
    $risk_score = 95
    $mitre_attack_tactic = "Collection"
    $mitre_attack_technique = "Unsecured Credentials: Cloud Secrets"
    $mitre_attack_technique_id = "T1552.004"

  condition:
    $event
}
